# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     3
1     1
2     2
3     4
4     1
5     1
6     4
7     1
8     4
9     3
10    2
11    2
12    1
13    1
14    3
15    1
16    4
17    2
18    4
19    2
20    4
21    4
22    4
23    4
24    1
25    4
26    1
27    2
28    1
29    3
     ..
70    4
71    3
72    2
73    4
74    1
75    4
76    1
77    2
78    4
79    1
80    4
81    2
82    3
83    3
84    2
85    4
86    2
87    4
88    3
89    2
90    3
91    2
92    1
93    2
94    3
95    4
96    2
97    2
98    4
99    1
Length: 100, dtype: int32 0     3
1     1
2     1
3     1
4     1
5     3
6     2
7     3
8     2
9     2
10    2
11    3
12    1
13    1
14    2
15    3
16    3
17    1
18    1
19    3
20    1
21    1
22    1
23    2
24    2
25    3
26    2
27    3
28    2
29    1
     ..
70    3
71    3
72    3
73    2
74    2
75    1
76    1
77    3
78    2
79    2
80    1
81    3
82    1
83    3
84    2
85    3
86    1
87    1
88    1
89    2
90    3
91    3
92    3
93    1
94    1
95    1
96    2
97    1
98    1
99    1
Length: 100, dtype: int32 0     27795
1     14771
2     10939
3     29544
4     15236
5     29313
6     16032
7     28038
8     15346
9     11995
10    17235
11    10965
12    20625
13    27021
14    22824
15    23930
16    18775
17    24568
18    29439
19    17334
20    24716
21    27484
22    15179
23    17975
24    22993
25    25461
26    19267
27    14884
28    26265
29    23356
      ...
70    21160
71    29812
72    29713
73    20547
74    20354
75    23735
76    16386
77    10738
78    20778
79    24404
80    26891
81    19586
82    11767
83    16718
84    13823
85    14515
86    15095
87    16876
88    23646
89    12994
90    20932
91    20681
92    25837
93    23794
94    11856
95    26964
96    21904
97    21983
98    12840
99    12921
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
housemkt = pd.concat([s1,s2,s3], axis=1)
housemkt.head()

   0  1      2
0  3  3  27795
1  1  1  14771
2  2  1  10939
3  4  1  29544
4  1  1  15236

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [13]:
housemkt.rename(columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       3            27795
1      1       1            14771
2      2       1            10939
3      4       1            29544
4      1       1            15236

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [17]:
bigcolumn = pd.concat([s1,s2,s3], axis=0)
print(type(bigcolumn))
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn.head()

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

   0
0  3
1  1
2  2
3  4
4  1

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [19]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [21]:
bigcolumn.reset_index(drop=False, inplace=True)
bigcolumn

     index      0
0        0      3
1        1      1
2        2      2
3        3      4
4        4      1
5        5      1
6        6      4
7        7      1
8        8      4
9        9      3
10      10      2
11      11      2
12      12      1
13      13      1
14      14      3
15      15      1
16      16      4
17      17      2
18      18      4
19      19      2
20      20      4
21      21      4
22      22      4
23      23      4
24      24      1
25      25      4
26      26      1
27      27      2
28      28      1
29      29      3
..     ...    ...
270    270  21160
271    271  29812
272    272  29713
273    273  20547
274    274  20354
275    275  23735
276    276  16386
277    277  10738
278    278  20778
279    279  24404
280    280  26891
281    281  19586
282    282  11767
283    283  16718
284    284  13823
285    285  14515
286    286  15095
287    287  16876
288    288  23646
289    289  12994
290    290  20932
291    291  20681
292    292  25837
293    293  23794
294    294  11856
295    295  26964
296    296  21904
297    297  21983
298    298  12840
299    299  12921

[300 rows x 2 columns]